<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8fd4e0bfc3de6d227bd431b8f595e5b7f44da01d759ee1486f57c4ae694562e7","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #841 at https://github.com/cal-itp/data-infra/actions/runs/18731413829","plan_out_hash":"4352925b9ed921cfc6355b9495daa02cfa1ccc001c76f30e7662623233fe93c7","plan_hash":"a0c92e1d7d21db6d509966bd2b9d0b77d440b531bf01e5ee42abaadaa80e3700","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/dbt_bigquery_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "gVWiHg==" -> (known after apply)
!~      detect_md5hash      = "U39kK/06lyAM/UprVAIxAA==" -> "different hash"
!~      generation          = 1761158212705676 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/dbt_bigquery_to_gcs_operator.py"
!~      md5hash             = "U39kK/06lyAM/UprVAIxAA==" -> (known after apply)
        name                = "plugins/operators/dbt_bigquery_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "GPiWEw==" -> (known after apply)
!~      detect_md5hash      = "25DuojQQ0ulHk0N6l5TjEQ==" -> "different hash"
!~      generation          = 1761158212692754 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "25DuojQQ0ulHk0N6l5TjEQ==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #841](https://github.com/cal-itp/data-infra/actions/runs/18731413829)